## Slice data

This notebook we are doing series and pandas slicing:
One thing importance *When slicing we are creating a VIEW so it will change the origin value*

In [13]:
import numpy as np
import pandas as pd

In [23]:
s1 = pd.Series(np.arange(5),index=['A','B','C','D','E'])
s1

A    0
B    1
C    2
D    3
E    4
dtype: int32

In [41]:
s1[(s1>2)&(s1<5)]=6

In [42]:
s1

A    0
B    1
C    2
D    6
E    6
dtype: int32

In [15]:
s2=s1[:3]
s2

A    0
B    1
C    2
dtype: int32

In [16]:
s2['A']=2018
s2

A    2018
B       1
C       2
dtype: int32

In [17]:
s1

A    2018
B       1
C       2
D       3
E       4
dtype: int32

In [18]:
s1['B']

1

In [19]:
s1[['A','B','C']]

A    2018
B       1
C       2
dtype: int32

In [20]:
s1[0:3]

A    2018
B       1
C       2
dtype: int32

In [21]:
s1[s1>2]

A    2018
D       3
E       4
dtype: int32

In [22]:
s1[s1>3] = 10
s1

A    10
B     1
C     2
D     3
E    10
dtype: int32

### Panda Dataframe Slicing

In [44]:
df1 = pd.DataFrame(np.random.randn(4,5),index=['r1','r2','r3','r4'],columns=['c1','c2','c3','c4','c5'])
df1

          c1        c2        c3        c4        c5
r1 -1.097822  0.453268  0.679946 -0.565169  0.472668
r2 -1.931198 -1.421412  1.335657  0.941653 -1.926224
r3  0.819862 -0.649489  0.111796  0.443226 -0.818389
r4 -0.028505 -1.455006 -0.017928  0.870538 -0.176468

In [9]:
df1['c1']

r1   -2.091071
r2   -0.794011
r3   -0.813414
r4    0.728546
Name: c1, dtype: float64

In [11]:
# 选取多列

In [10]:
df1[['c1','c4','c3']]

          c1        c4        c3
r1 -2.091071 -0.988317  0.341497
r2 -0.794011 -0.666495 -0.728108
r3 -0.813414 -0.136221  0.476005
r4  0.728546 -0.897217 -0.523791

In [45]:
df1[df1['c2']>0]

          c1        c2        c3        c4        c5
r1 -1.097822  0.453268  0.679946 -0.565169  0.472668

In [46]:
df1<0

       c1     c2     c3     c4     c5
r1   True  False  False   True  False
r2   True   True  False  False   True
r3  False   True  False  False   True
r4   True   True   True  False   True

In [13]:
df1.ix['r2']

c1   -0.794011
c2   -0.494914
c3   -0.728108
c4   -0.666495
c5    0.511893
Name: r2, dtype: float64

In [51]:
df1

          c1        c2        c3        c4        c5
r1 -1.097822  0.453268  0.679946 -0.565169  0.472668
r2 -1.931198 -1.421412  1.335657  0.941653 -1.926224
r3  0.819862 -0.649489  0.111796  0.443226 -0.818389
r4 -0.028505 -1.455006 -0.017928  0.870538 -0.176468

In [52]:
df1.iloc[1]

c1   -1.931198
c2   -1.421412
c3    1.335657
c4    0.941653
c5   -1.926224
Name: r2, dtype: float64

In [50]:
df1.loc['r2']

c1   -1.931198
c2   -1.421412
c3    1.335657
c4    0.941653
c5   -1.926224
Name: r2, dtype: float64

In [53]:
df1.iloc[[0,2,3],[0,2]]

          c1        c3
r1 -1.097822  0.679946
r3  0.819862  0.111796
r4 -0.028505 -0.017928

In [54]:
df2 = df1.copy()
df2['c6'] = ['one', 'one','two','three']

In [18]:
df2

          c1        c2        c3        c4        c5     c6
r1 -2.091071 -0.530994  0.341497 -0.988317 -1.328240    one
r2 -0.794011 -0.494914 -0.728108 -0.666495  0.511893    one
r3 -0.813414 -0.059143  0.476005 -0.136221  1.158016    two
r4  0.728546 -1.937596 -0.523791 -0.897217  0.657341  three

In [55]:
df2['c6'].isin(['two','three'])

r1    False
r2    False
r3     True
r4     True
Name: c6, dtype: bool

In [19]:
df2[df2['c6'].isin(['two','three'])]

          c1        c2        c3        c4        c5     c6
r3 -0.813414 -0.059143  0.476005 -0.136221  1.158016    two
r4  0.728546 -1.937596 -0.523791 -0.897217  0.657341  three